run/vawt_test_farfield/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

patches
(
    {
	name            inlet;
	patchInfo
	{
	type            patch;
	}
	constructFrom patches;
	patches (Inlet);
    }
    {
	name            outlet;
	patchInfo
	{
	type            patch;
	}
	constructFrom patches;
	patches (Outlet);
    }
    {
	name            sides;
	patchInfo
	{
	type            wall;
	}
	constructFrom patches;
	patches (Sides);
    }
    {
	name            foil;
	patchInfo
	{
	type            wall;
	}
	constructFrom patches;
	patches (Foil);
    } 
    {
	name            frontAndBack;
	patchInfo
	{
	type            empty;
	}
	constructFrom patches;
	patches (bottomEmptyFaces topEmptyFaces);
    }   
);

// ************************************************************************* //
