run/vawt_test_farfield/system/meshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile     "domain_farfield.fms";

maxCellSize     0.1;



objectRefinements
{
	wake
        {
            cellSize 0.025;
            type box;
            centre (0 0 0);
            lengthX 3;
            lengthY 3;
            lengthZ 1;
        }
}

edgeMeshRefinement
{

}

localRefinement
{

}

boundaryLayers
{

}


// ************************************************************************* //
